In [1]:
import pandas as pd

In [3]:
data=pd.read_csv('Placement.csv')

In [53]:
data.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [4]:
data.columns

Index(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation', 'mba_p',
       'status', 'salary'],
      dtype='object')

In [8]:
data['ssc_p'].dtype

dtype('float64')

In [16]:
Qual=[i for i in data.columns if data[i].dtype=='O']
Quan=[i for i in data.columns if data[i].dtype!='O']

In [17]:
print(Quan,Qual)

['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary'] ['gender', 'ssc_b', 'hsc_b', 'hsc_s', 'degree_t', 'workex', 'specialisation', 'status']

In [19]:
data['ssc_p']

0      67.00
1      79.33
2      65.00
3      56.00
4      85.80
       ...
210    80.60
211    58.00
212    67.00
213    74.00
214    62.00
Name: ssc_p, Length: 215, dtype: float64

In [21]:
data['sl_no'].mean()

108.0

In [22]:
data['sl_no'].median()

108.0

In [24]:
data['sl_no'].mode()[0]

1

In [46]:
compute_MMM_data=pd.DataFrame(index=['Means','Median','Mode'], columns=Quan)

In [47]:
compute_MMM_data

       sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Means    NaN   NaN   NaN      NaN     NaN   NaN    NaN
Median   NaN   NaN   NaN      NaN     NaN   NaN    NaN
Mode     NaN   NaN   NaN      NaN     NaN   NaN    NaN

In [48]:
compute_MMM_data['sl_no']['Means']=0

In [49]:
compute_MMM_data

       sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Means      0   NaN   NaN      NaN     NaN   NaN    NaN
Median   NaN   NaN   NaN      NaN     NaN   NaN    NaN
Mode     NaN   NaN   NaN      NaN     NaN   NaN    NaN

In [50]:
for colm in Quan:
    compute_MMM_data[colm]['Means']=data[colm].mean()
    compute_MMM_data[colm]['Median']=data[colm].median()
    compute_MMM_data[colm]['Mode']=data[colm].mode()[0]

In [51]:
compute_MMM_data

       sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Means    108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median   108       67       65       66       71       62  265000
Mode       1       62       63       65       60     56.7  300000

In [44]:
compute_MMM_data=pd.DataFrame( columns=['ssc_p'])

In [42]:
compute_MMM_data

Empty DataFrame
Columns: [ssc_p]
Index: []

In [54]:
compute_MMM_data

       sl_no    ssc_p    hsc_p degree_p  etest_p    mba_p  salary
Means    108  67.3034  66.3332  66.3702  72.1006  62.2782  288655
Median   108       67       65       66       71       62  265000
Mode       1       62       63       65       60     56.7  300000

In [55]:
data.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000